In [36]:
#Import Numpy
import numpy as np
#Import pandas
import pandas as pd

In [38]:
#Convert list into series of elements
l = [10,20,30,40,50]
s1 = pd.Series(data = l, index = ['a','b','c','d','e'])
s1

a    10
b    20
c    30
d    40
e    50
dtype: int64

In [39]:
print(s1)

a    10
b    20
c    30
d    40
e    50
dtype: int64

In [40]:
type(s1)

pandas.core.series.Series

In [41]:
#Convert dictionaries into series of elements
d = {'a':10,'b':20,'c':30,'d':40,'e':50}
s2 = pd.Series(d)
s2

a    10
b    20
c    30
d    40
e    50
dtype: int64

In [6]:
# print(s2)

In [7]:
# type(s2)

In [44]:
#Addition of two series
ser1=pd.Series([1,2,3,4],['India','Srilanka', 'Bangladesh', 'Russia'])
print(ser1)
ser2=pd.Series([1,2,5,9],['India','Srilanka', 'Bangladesh', 'Russia'])
print(ser2)
print(ser1+ser2)

India         1
Srilanka      2
Bangladesh    3
Russia        4
dtype: int64
India         1
Srilanka      2
Bangladesh    5
Russia        9
dtype: int64
India          2
Srilanka       4
Bangladesh     8
Russia        13
dtype: int64

In [57]:
#Create dataframe and select columns
#Syntax - pd.DataFrame(data, index_labels , columns_labels)
df1 = pd.DataFrame(np.random.randn(5,4),['A','B','C','D','E'],['W','X','Y','Z'])
df1

          W         X         Y         Z
A -0.462573 -0.345286 -0.601126 -0.272274
B  1.146369  0.511004 -0.222594  0.421412
C  0.657211  0.261663 -0.816424  0.418236
D -2.795874 -0.074652 -0.164761  1.407457
E -0.215099  0.824519  0.695639  0.960054

In [46]:
#Accessing one column of the dataframe
df1['W']

A    1.184867
B    0.028084
C   -0.442247
D    0.361100
E   -2.874047
Name: W, dtype: float64

In [47]:
#Accessing many columns in one go * pay attention that argument is passed as a list of columns names
df1[['W','Z']]

          W         Z
A  1.184867 -0.499954
B  0.028084  0.758666
C -0.442247 -1.570406
D  0.361100  0.255651
E -2.874047  1.252391

In [50]:
#Data selection with loc and iloc

#Accessing data with index values - Use loc
print(df1.loc["A"])

#Acdessing the data with row numbers - use iloc
print(df1.iloc[0])

#Access a block through your dataframe OR lets say subset the data
print(df1.loc[['A','C'],['W','Y']])

W    1.184867
X   -0.260572
Y   -1.205792
Z   -0.499954
Name: A, dtype: float64
W    1.184867
X   -0.260572
Y   -1.205792
Z   -0.499954
Name: A, dtype: float64
          W         Y
A  1.184867 -1.205792
C -0.442247  1.599957

In [51]:
#Subsetting based on boolean condition
df1[df1>0]

          W         X         Y         Z
A  1.184867       NaN       NaN       NaN
B  0.028084  0.146719  0.656697  0.758666
C       NaN       NaN  1.599957       NaN
D  0.361100       NaN       NaN  0.255651
E       NaN       NaN       NaN  1.252391

In [56]:
#Dropping rows and columns by drop method
df1.drop('A',axis=0,inplace=False)
# df1.drop('W',axis=1,inplace=False)
# df1.drop('W',axis=1,inplace=True)
df1

          X         Y         Z
A -0.260572 -1.205792 -0.499954
B  0.146719  0.656697  0.758666
C -1.879910  1.599957 -1.570406
D -0.118617 -0.460104  0.255651
E -0.447656 -0.627648  1.252391

In [15]:
# df1['W']

In [58]:
#Subsetting plus boolean conditions
df1[df1['W']>0][['X','Y']]

          X         Y
B  0.511004 -0.222594
C  0.261663 -0.816424

In [61]:
#Reset indexing 
df3 = df1.reset_index(drop =False)
df3

  index         W         X         Y         Z
0     A -0.462573 -0.345286 -0.601126 -0.272274
1     B  1.146369  0.511004 -0.222594  0.421412
2     C  0.657211  0.261663 -0.816424  0.418236
3     D -2.795874 -0.074652 -0.164761  1.407457
4     E -0.215099  0.824519  0.695639  0.960054

In [62]:
#setting indexes
df4 = df1.set_index('Z')
df4

                  W         X         Y
Z
-0.272274 -0.462573 -0.345286 -0.601126
 0.421412  1.146369  0.511004 -0.222594
 0.418236  0.657211  0.261663 -0.816424
 1.407457 -2.795874 -0.074652 -0.164761
 0.960054 -0.215099  0.824519  0.695639

In [70]:
#Dropping missing values
d={'A':[1,2,np.NaN], 'B':[1,np.NaN,np.NaN],'C':[1,2,3]}
# np.NaN is the missing element in DataFrame
df5=pd.DataFrame(d)
print(df5)
# df5.dropna()       #drop any row with missing value
# df5.dropna(axis=1) #drop column with NULL value
df5.dropna(thresh=2) #Require <2 non-NA values to drop row.

     A    B  C
0  1.0  1.0  1
1  2.0  NaN  2
2  NaN  NaN  3

     A    B  C
0  1.0  1.0  1
1  2.0  NaN  2

In [71]:
#Filling missing values with something
df5['B'].fillna(value=df5['B'].mean())

0    1.0
1    1.0
2    1.0
Name: B, dtype: float64

In [72]:
#Replacing specific values
df5 = pd.DataFrame({'one':[10,20,30,40,50,2000], 'two':[1000,0,30,40,50,60]})
print(df5)
print(df5.replace({1000:10,2000:60}))

    one   two
0    10  1000
1    20     0
2    30    30
3    40    40
4    50    50
5  2000    60
   one  two
0   10   10
1   20    0
2   30   30
3   40   40
4   50   50
5   60   60

In [74]:
#Groupby function
data = {'Company': [ 'CompA', 'CompA', 'CompB', 'CompB', 'CompC', 'CompC'],
        'Person': ['Rajesh', 'Pradeep', 'Amit', 'Rakesh', 'Suresh', 'Raj'],
        'Sales': [200, 120, 340, 124, 243, 350]}
df6=pd.DataFrame(data)
print(df6)
comp=df6.groupby("Company")['Sales'].sum()#grouping done using label name “Company”
comp

  Company   Person  Sales
0   CompA   Rajesh    200
1   CompA  Pradeep    120
2   CompB     Amit    340
3   CompB   Rakesh    124
4   CompC   Suresh    243
5   CompC      Raj    350

Company
CompA    320
CompB    464
CompC    593
Name: Sales, dtype: int64

In [76]:
#Finding unique value & number of occurrence from Dataframe

df = pd.DataFrame({'col1':[1,2,3,4],'col2':[444,555,666,444],'col3':['abc','def','ghi','xyz']})
print(df)

# col1, col2 & col3 are column labels, each column have their own values
print(df['col2'].unique()) #fetches the unique values available in column

print(df['col2'].value_counts()) # count number of occurance of every value

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz
[444 555 666]
444    2
555    1
666    1
Name: col2, dtype: int64

In [78]:
#File Handling

#Reading from a file
df6 = pd.read_csv("test1.csv")
print(df6)

#Writing to a file
df6.to_csv('data.csv')

# Read a Excel File
# df = pd.read_excel('filename_with_path',sheet_name='SheetName')
# Write a Excel File with Single sheet
# df.to_excel('filename_with_path',sheet_name='SheetName')

      Series_reference   Period  Data_value  Suppressed STATUS    UNITS  \
0           ECTA.S19A1  2001.03      2462.5         NaN      F  Dollars
1           ECTA.S19A1  2002.03     17177.2         NaN      F  Dollars
2           ECTA.S19A1  2003.03     22530.5         NaN      F  Dollars
3           ECTA.S19A1  2004.03     28005.1         NaN      F  Dollars
4           ECTA.S19A1  2005.03     30629.6         NaN      F  Dollars
...                ...      ...         ...         ...    ...      ...
16673       ECTQ.S4AXP  2018.12        44.4         NaN      F  Percent
16674       ECTQ.S4AXP  2019.03        43.5         NaN      F  Percent
16675       ECTQ.S4AXP  2019.06        44.9         NaN      F  Percent
16676       ECTQ.S4AXP  2019.09        44.9         NaN      F  Percent
16677       ECTQ.S4AXP  2019.12        43.6         NaN      F  Percent

       Magnitude                                        Subject  \
0              6  Electronic Card Transactions (ANZSIC06) - ECT
1              6  Electronic Card Transactions (ANZSIC06) - ECT
2              6  Electronic Card Transactions (ANZSIC06) - ECT
3              6  Electronic Card Transactions (ANZSIC06) - ECT
4              6  Electronic Card Transactions (ANZSIC06) - ECT
...          ...                                            ...
16673          0  Electronic Card Transactions (ANZSIC06) - ECT
16674          0  Electronic Card Transactions (ANZSIC06) - ECT
16675          0  Electronic Card Transactions (ANZSIC06) - ECT
16676          0  Electronic Card Transactions (ANZSIC06) - ECT
16677          0  Electronic Card Transactions (ANZSIC06) - ECT

                                                   Group Series_title_1  \
0      Total values - Electronic card transactions A/...         Actual
1      Total values - Electronic card transactions A/...         Actual
2      Total values - Electronic card transactions A/...         Actual
3      Total values - Electronic card transactions A/...         Actual
4      Total values - Electronic card transactions A/...         Actual
...                                                  ...            ...
16673  Electronic card transactions by mean and propo...         Actual
16674  Electronic card transactions by mean and propo...         Actual
16675  Electronic card transactions by mean and propo...         Actual
16676  Electronic card transactions by mean and propo...         Actual
16677  Electronic card transactions by mean and propo...         Actual

                                          Series_title_2  Series_title_3  \
0                                   RTS total industries             NaN
1                                   RTS total industries             NaN
2                                   RTS total industries             NaN
3                                   RTS total industries             NaN
4                                   RTS total industries             NaN
...                                                  ...             ...
16673  Debit card usage as a proportion of total ECT ...  Proportion (%)
16674  Debit card usage as a proportion of total ECT ...  Proportion (%)
16675  Debit card usage as a proportion of total ECT ...  Proportion (%)
16676  Debit card usage as a proportion of total ECT ...  Proportion (%)
16677  Debit card usage as a proportion of total ECT ...  Proportion (%)

       Series_title_4  Series_title_5
0                 NaN             NaN
1                 NaN             NaN
2                 NaN             NaN
3                 NaN             NaN
4                 NaN             NaN
...               ...             ...
16673             NaN             NaN
16674             NaN             NaN
16675             NaN             NaN
16676             NaN             NaN
16677             NaN             NaN

[16678 rows x 14 columns]